---
kind: other
id: Properties.T:Autodesk.Revit.DB.ViewShapeBuilder
source: html/fea8f636-aa3a-4191-d4de-376e52904d79.htm
---
# ViewShapeBuilder Properties

Specifies whether the .NET object represents a valid Revit entity.